Revit 2027 API
BuiltInFailures.BeamSystemFailures Class
 Failures about BeamSystem.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BeamSystemFailures
Public NotInheritable Class BeamSystemFailures
public ref class BeamSystemFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BeamSystemFailures = class end
The BuiltInFailures.BeamSystemFailures type exposes the following members.
Properties
Name | Description
BeamSystemEdgeBeamTooWide |  Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.
BeamSystemHasTooManyBeams |  A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired.
BeamSystemTagBadView |  Beam System Tags can only be placed in plan , elevation and 3D views.
Top
See Also
Reference
Autodesk.Revit.DB Namespace